Script started on Wed 10 Feb 2016 10:00:44 AM PST
[?1034hbash-4.2$ gdb uninit
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.8.2-38.el7
Copyright (C) 2014 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from uninit...done.
(gdb) run
Starting program: /afs/cats.ucsc.edu/users/i/midquan/private/cmps012b/Labs/lab5/uninit 
Missing separate debuginfos, use: debuginfo-install glibc-2.17-106.el7_2.1.x86_64
pointer=(nil)

Program received signal SIGSEGV, Segmentation fault.
0x000000000040060f in main (argc=1, argv=0x7fffffffdc28) at uninit.c:9
9	   printf ("*pointer=%d\n", *pointer);
(gdb) where
#0  0x000000000040060f in main (argc=1, argv=0x7fffffffdc28) at uninit.c:9
(gdb) list
4	#include <stdlib.h>
5	
6	int main (int argc, char **argv) {
7	   int *pointer;
8	   printf ("pointer=%p\n", pointer);
9	   printf ("*pointer=%d\n", *pointer);
10	   int foo;
11	   printf ("foo=%d\n", foo);
12	}
(gdb) print foo
$1 = 32767
(gdb) print pointer
$2 = (int *) 0x0
(gdb) print *pointer
Cannot access memory at address 0x0
(gdb) print argv[0]
$3 = 0x7fffffffdf35 "/afs/cats.ucsc.edu/users/i/midquan/private/cmps012b/Labs/lab5/uninit"
(gdb) quit
A debugging session is active.

	Inferior 1 [process 2345] will be killed.

Quit anyway? (y or n) yes
bash-4.2$ exit
exit

Script done on Wed 10 Feb 2016 10:01:27 AM PST
