Script started on Wed 10 Feb 2016 05:08:55 PM PST
[?1034hbash-4.2$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.8.2-38.el7
Copyright (C) 2014 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from list2...done.
(gdb) break main
Breakpoint 1 at 0x400685: file list2.c, line 14.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/i/midquan/private/cmps012b/Labs/lab5/list2 foo bar
Missing separate debuginfos, use: debuginfo-install glibc-2.17-106.el7_2.1.x86_64

Breakpoint 1, main (argc=3, argv=0x7fffffffdbe8) at list2.c:14
14	   for (int argi = 0; argi < 5; ++argi) {
(gdb) print argc
$1 = 3
(gdb) print argv
$2 = (char **) 0x7fffffffdbe8
(gdb) print argv[0]
$3 = 0x7fffffffdf06 "/afs/cats.ucsc.edu/users/i/midquan/private/cmps012b/Labs/lab5/list2"
(gdb) print argv[0][1P]1]
$4 = 0x7fffffffdf4a "foo"
(gdb) print argv[1][1P]2]
$5 = 0x7fffffffdf4e "bar"
(gdb) print argv[2][1P]3]
$6 = 0x0
(gdb) print argv[3][1P]4]
$7 = 0x7fffffffdf52 "MANPATH=/opt/rh/devtoolset-3/root/usr/share/man:/opt/rh/rh-java-common/root/usr/share/man::/var/cfengine/share/man"
(gdb) print argv[4][1P]5]
$8 = 0x7fffffffdfc5 "XDG_SESSION_ID=21971"
(gdb) print argv[5][1P]6]
$9 = 0x7fffffffdfda "HOSTNAME=unix1.lt.ucsc.edu"
(gdb) exit[K[K[K[Kquit
A debugging session is active.

	Inferior 1 [process 5786] will be killed.

Quit anyway? (y or n) yes
bash-4.2$ exit
exit

Script done on Wed 10 Feb 2016 05:11:18 PM PST
