Script started on Wed 10 Feb 2016 04:13:26 PM PST
[?1034hbash-4.2$ valgring[Kd malloc
==2429== Memcheck, a memory error detector
==2429== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==2429== Using Valgrind-3.10.1 and LibVEX; rerun with -h for copyright info
==2429== Command: malloc
==2429== 
0x54f8090-> {6, (nil)}
==2429== 
==2429== HEAP SUMMARY:
==2429==     in use at exit: 16 bytes in 1 blocks
==2429==   total heap usage: 2 allocs, 1 frees, 32 bytes allocated
==2429== 
==2429== LEAK SUMMARY:
==2429==    definitely lost: 16 bytes in 1 blocks
==2429==    indirectly lost: 0 bytes in 0 blocks
==2429==      possibly lost: 0 bytes in 0 blocks
==2429==    still reachable: 0 bytes in 0 blocks
==2429==         suppressed: 0 bytes in 0 blocks
==2429== Rerun with --leak-check=full to see details of leaked memory
==2429== 
==2429== For counts of detected and suppressed errors, rerun with: -v
==2429== ERROR SUMMARY: 0 errors from 0 contexts (suppressed: 1 from 1)
bash-4.2$ gdb malloc
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.8.2-38.el7
Copyright (C) 2014 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from malloc...done.
(gdb) break main
Breakpoint 1 at 0x400685: file malloc.c, line 13.
(gdb) run
Starting program: /afs/cats.ucsc.edu/users/i/midquan/private/cmps012b/Labs/lab5/malloc 
Missing separate debuginfos, use: debuginfo-install glibc-2.17-106.el7_2.1.x86_64

Breakpoint 1, main (argc=1, argv=0x7fffffffdc28) at malloc.c:13
13	   node *ptr = malloc (sizeof (struct node));
(gdb) print pr[Ktr
$1 = (node *) 0x0
(gdb) print *ptr
Cannot access memory at address 0x0
(gdb) next
14	   ptr = malloc (sizeof (node));
(gdb) print ptr
$2 = (node *) 0x602010
(gdb) print *ptr
$3 = {value = 0, link = 0x0}
(gdb) next
15	   ptr->value = 6;
(gdb) next
16	   ptr->link = NULL;
(gdb) next
17	   printf ("%p-> {%d, %p}\n", ptr, ptr->value, ptr->link);
(gdb) print ptr
$4 = (node *) 0x602030
(gdb) print *ptr
$5 = {value = 6, link = 0x0}
(gdb) next
0x602030-> {6, (nil)}
18	   free (ptr);
(gdb) next
19	   return EXIT_SUCCESS;
(gdb) next
20	}
(gdb) next
0x00007ffff7739b15 in __libc_start_main () from /lib64/libc.so.6
(gdb) quit
A debugging session is active.

	Inferior 1 [process 3519] will be killed.

Quit anyway? (y or n) yes
bash-4.2$ exit
exit

Script done on Wed 10 Feb 2016 04:15:42 PM PST
